
ls1 = [1, 22, -12, -4, -27, 5, 108, 45, 34, 98]
print(ls1)

s = 0
# сумма отрицательных чисел
for i in ls1:
    if i < 0:
        s += i
        # s = s + i
print(s)

# сумма четных чисел
s = 0
for i in ls1:
    if i % 2 == 0:
        s += i
        # s = s + i
print(s)

# сумма нечетных чисел
s = 0
for i in ls1:
    if i % 2 != 0:
        s += i
        # s = s + i
print(s)

# Произведение элементов с индексами кратными 3;
s = 1
for i in range(len(ls1)):
    if i % 3 == 0:
        s *= ls1[i]
        # s = s + i
print(s)

# Произведение элементов между минимальным и
# максимальным элементом;
ls1 = [1, 22, -12, -4, -27, 5, 108, 45, 34, 98]
ls1_max = max(ls1)
ls1_min = min(ls1)
print(ls1_max * ls1_min)

a = ls1.index(ls1_min)
b = ls1.index(ls1_max)

ls2 = ls1[a:b]

# Сумму элементов, находящихся между первым 
# и последним положительными элементами.





